# CurveElementType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveElement..::..CurveElementType Property
CurveElement Class See Also
---
Type of the curve element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveElementType CurveElementType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CurveElementType As CurveElementType
	Get
```

Visual C++
---
```text
public:
property CurveElementType CurveElementType {
	CurveElementType get ();
}
```

# See Also
CurveElement Class
Autodesk.Revit.DB Namespace